I'm confused by this behaviour. The diff is the same.

```
2020/10/08 00:37:17 [INFO] Instantiating Google Cloud CloudIdentity client for path https://cloudidentity.googleapis.com/
2020/10/08 00:37:17 [DEBUG] Running CustomizeDiff. old value: projects/-/serviceAccounts/550924169191-compute@developer.gserviceaccount.com, new value: projects/-/serviceAccounts/550924169191-compute@developer.gserviceaccount.com
2020/10/08 00:37:17 [DEBUG] Running CustomizeDiff. old value: , new value: 
    TestAccApiGatewayApiConfig_apigatewayApiConfigBasicExample: provider_test.go:267: Step 1/1 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # google_api_gateway_api_config.api_cfg must be replaced
        -/+ resource "google_api_gateway_api_config" "api_cfg" {
                api               = "test"
                api_config_id     = "tf-test-api-cfg7b2myyjwop"
              + create_time       = (known after apply)
                display_name      = "MM Dev API Config"
              ~ id                = "projects/REDACTED/locations/global/apis/test/configs/tf-test-api-cfg7b2myyjwop" -> (known after apply)
                labels            = {
                    "environment" = "dev"
                }
              ~ name              = "projects/550924169191/locations/global/apis/test/configs/tf-test-api-cfg7b2myyjwop" -> (known after apply)
              ~ project           = "REDACTED" -> (known after apply)
              ~ service_config_id = "tf-test-api-cfg7b2myyjwop-2r0x5xxpaan7e" -> (known after apply)
        
              - gateway_config {
                  - backend_config {
                      - google_service_account = "projects/-/serviceAccounts/550924169191-compute@developer.gserviceaccount.com" -> null
                    }
                }
        
              + openapi_documents {
                  + document {
                      + contents = "c3dhZ2dlcjogJzIuMCcKaW5mbzoKICB0aXRsZTogZGV2IAogIGRlc2NyaXB0aW9uOiBTYW1wbGUgQVBJIG9uIEFQSSBHYXRld2F5IHdpdGggYSBDbG91ZCBSdW4gYmFja2VuZAogIHZlcnNpb246IDEuMC4wCnNjaGVtZXM6CiAgLSBodHRwcwpwcm9kdWNlczoKICAtIGFwcGxpY2F0aW9uL2pzb24KcGF0aHM6CiAgL2hlbGxvOgogICAgZ2V0OgogICAgICBzdW1tYXJ5OiBHcmVldCBhIHVzZXIKICAgICAgb3BlcmF0aW9uSWQ6IGhlbGxvCiAgICAgIHgtZ29vZ2xlLWJhY2tlbmQ6CiAgICAgICAgYWRkcmVzczogaHR0cHM6Ly9nb29nbGUuY29tCiAgICAgIHJlc3BvbnNlczoKICAgICAgICAnMjAwJzoKICAgICAgICAgIGRlc2NyaXB0aW9uOiBBIHN1Y2Nlc3NmdWwgcmVzcG9uc2UKICAgICAgICAgIHNjaGVtYToKICAgICAgICAgICAgdHlwZTogc3RyaW5n"
                      + path     = "spec.yaml"
                    }
                }
            }
        
        Plan: 1 to add, 0 to change, 1 to destroy.
2020/10/08 00:37:23 [INFO] Authenticating using DefaultClient...

```